[
    {
        "id": "Boolean algebra",
        "year": "1854",
        "desc": "George Boole starts modern logic with his book 'The laws of thought', in which expounds an algebra of logic",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/The_Laws_of_Thought"
        }
    },
    {
        "id": "Sense and reference, semantic compositionality",
        "year": "1880-1900",
        "desc": "In the late nineteenth century Gottlob Frege laid the ground work for modern logic and the philosophy of language with his function-argument analysis of the proposition, the distinction between concept and object, the principle of compositionality, the context principle and the distinction between sense and reference.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Gottlob_Frege#Philosopher"
        }
    },
    {
        "id": "The Turing Test",
        "year": "1950",
        "desc": "In his 1950 paper \"Computing Machinery and Intelligence\" Alan Turing poses the question \"Can machines think?\" and proposes to interpret it in terms of an \"imitation game\". In this game an interrogator must decide whether the agent in the other room is a man or a machine. He is only allowed to communicate with him or it via typed print. This game is now known as the Turing Test."
    },
    {
        "id": "Language games, meaning as use",
        "year": "1953",
        "desc": "Ludwig Wittgenstein's book \"Philisophical Investigations\" is published posthumously. Herein he develops the concept of \"Language game\": the use of language can be compared to a game, in that lanuage interactions are bound by rules, and the words and sentences used in the game derive their meaning from the use in the game. Wittgenstein also noted that the meaning of a word should be found in the use of the word in the game.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Language_game_(philosophy)"
        }
    },
    {
        "id": "IPL",
        "year": "1956",
        "desc": "IPL was invented by  Allen Newell, Cliff Shaw, and Herbert Simon at RAND Corp and Carnegie Institute of Technology. IPL invented the concept of list processing. It was used in several NLI systems.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Information_Processing_Language"
        },
        "dependencyOf": []
    },
    {
        "id": "AI",
        "year": "1956",
        "desc": "At the Dartmouth conference the field of Artificial Intelligence was born. It was posed that \"every aspect of learning of any other feature of intelligence can in principle be so precisely described that a machine can be made to simulate it.\" Main participants: Marvin Minsky, John McCarthy, Allen Newell, Herbert Simon. ",
        "dependencyOf": []
    },
    {
        "id": "Transformational grammar",
        "year": "1957",
        "desc": "Noam Chomsky publishes \"Syntactic Structures\", in which he introduces Transformational Grammar. It was used by a few NLI systems.",
        "links": {
            "Wikipedia": "http://en.wikipedia.org/wiki/Syntactic_Structures"
        },
        "dependencyOf": ["thoughttreasure"]
    },
    {
        "id": "COMIT",
        "year": "1957",
        "desc": "COMIT, the first string processing language, was invented by Victor Yngve as MIT. It was used in several NLI systems.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Information_Processing_Language"
        },
        "dependencyOf": []
    },
    {
        "id": "Generalized quantifiers",
        "year": "1957",
        "desc": "A. Mostowski extends the logical universal and existential quantifiers to generalized quantifiers. Natural language uses a wide range of quantifiers.",
        "links": {
            "Article": "http://matwbn.icm.edu.pl/ksiazki/fm/fm44/fm4412.pdf",
            "Encyclopedia.com": "https://www.encyclopedia.com/humanities/encyclopedias-almanacs-transcripts-and-maps/quantifiers-natural-language"
        },
        "dependencyOf": []
    },
    {
      "id": "Lisp",
      "year": "1958",
      "desc": "Lisp was invented by John McCarthy. The favored programming language for AI research. Influenced by IPL.",
      "links": {
        "Wikipedia": "https://en.wikipedia.org/wiki/Lisp_(programming_language)"
      },
      "dependencyOf": ["shrdlu", "lunar", "team", "c-phrase"]
    },
    {
        "id": "Programs with common sense",
        "year": "1959",
        "desc": "John McCarthy wrote the influential paper 'Programs with common sense'. The new idea was to use formal languages to solve ordinary commonsense reasoning, whereas logic was used before only to represent mathematical truths. The program to be written, 'Advice Taker', was to be a joint project with Marvin Minsky, but it was not realized. Reasoning is done by processing rules containing premises and conclusions (a(x, y), b(y, z), c(z, a) -> d(x, a)). Fischer Black later made a first implementation of this system (1964)",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Advice_taker"
        }
    },
    {
        "id": "Speech Acts",
        "year": "1962",
        "desc": "Speech Acts: J.L. Austin showed in his \"How to do things with words\" that sentences are not just conveyors of declarative meanings that are true or false. They may also be actions in themselves. A sentence may inquire, command, promise, etc. A speech act may require pragmatic information to be interpreted.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Speech_act"
        }
    },
    {
        "id": "Selectional Restrictions",
        "year": "1963",
        "desc": "Selectional restrictions specify the allowed values for predicate arguments. Work on selectional restrictions as a way of characterizing semantic well-formedness began with Katz and Fodor",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Selection_(linguistics)"
        }
    },
    {
        "id": "Chatbot",
        "year": "1966",
        "desc": "Joseph Weizenbaum invents the chatbot. Chatbots are accessible for the user and simple to create for a programmer. The chatbot uses hard-coded request-response rules. Many chatbots have since been created and they are still popular. In their basic form they are mindless, but they can be enhanced with other functions such as virtual assistance and decision support."},
    {
        "id": "Events as objects",
        "year": "1967",
        "desc": "Donald Davidson first explicitly represents events as objects in a formal representation in his paper 'The logical form of action sentences'"
    },
    {
        "id": "Chart parser",
        "year": "1968",
        "desc": "Jay Earley creates a chart parser for natural language parsing. Chart parsers use dynamic programming to memorize structures that have been built before in order to avoid double work.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Augmented_transition_network"
        },
        "dependencyOf": ["lunar"]
    },
    {
        "id": "Case Grammar",
        "year": "1968",
        "desc": "Case Grammar was developed by Charles J. Fillmore. It emphasises semantic roles of a sentence, Agent, Object, Benefactor, Location or Instrument.",
        "links": {
            "Wikipedia": "http://en.wikipedia.org/wiki/Case_grammar"
        },
        "dependencyOf": ["eufid"]
    },
    {
        "id": "Micro-Planner",
        "year": "1968",
        "desc": "Planner was created by Carl Hewitt (MIT), the first procedural programming language, implemented in Lisp. It applied forward and backward chaining. It was used by SHRDLU.",
        "links": {
            "Wikipedia": "http://en.wikipedia.org/wiki/Planner_programming_language"
        },
        "dependencyOf": ["shrdlu"]
    },
    {
        "id": "Semantic Memory",
        "year": "1969",
        "desc": "Quillian introduces Semantic Memory into NLI. Semantic Memory holds factual world knowledge.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Semantic_memory"
        }
    },
    {
        "id": "Conceptual Dependency",
        "year": "1969",
        "desc": "Roger Schank introduces \"Conceptual Dependency Theory\", a theory for natural language understanding that uses fundamental concepts like ATRANS, PTRANS and MTRANS to denote abstract transfers. "
    },
    {
        "id": "Augmented Transition Network",
        "year": "1970",
        "desc": "W.A. Woods invents the Augmented Transition Network (ATM), a finite state machine extension to parse natural language sentences.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Augmented_transition_network"
        },
        "dependencyOf": ["lunar"]
    },
    {
        "id": "Relational Databases",
        "year": "1970",
        "desc": "E.F. Codd (IBM) publishes \"A Relational Model of Data for Large Shared Data Banks\". The basis of modern relational databases.",
        "dependencyOf": ["rendezvous"]
    },

    {
        "id": "Semantic Parsing",
        "year": "1972",
        "desc": "Yorick Wilks coins the term 'semantic parsing' for parsing directly to semantic form, skipping syntax",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Semantic_parsing"
        }
    },

    {
        "id": "Prolog",
        "year": "1972",
        "desc": "Prolog was created by Alain Colmerauer and Philippe Roussel, based on Robert Kowalski's procedural interpretation of Horn clauses."
    },
    {
        "id": "Montague Grammar",
        "year": "1973",
        "desc": "Montague publishes \"The Proper Treatment of Quantification in Ordinary English\" (also known as PTQ), the first formal treatment of the semantics of natural languages. Since this article requires a good deal of prior knowledge of logic, you may wish to approach this article through Dowty et al's \"Introduction to Montague Semantics\"."
    },
    {
        "id": "Scripts",
        "year": "1975",
        "desc": "Roger Schank and Robert P. Abelson introduce Script Theory in AI. It is a psychological theory by Silvan Tomkins that explains how people know how to react in all sorts of stereotypical situations"
    },
    {
        "id": "Gricean maxims",
        "year": "1975",
        "desc": "Paul Grice states the implied assumptions in a conversation. These so called Gricean maxims are: conversation should be informative, true, relevant and clear",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Paul_Grice#Intention-based_semantics"
        }
    },
    {
        "id": "Feature Unification",
        "year": "1979",
        "desc": "Kay invents Feature Structure Unification, an enhancement to phrase structure grammars that enforces features such as tense and number",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Feature_structure"
        }
    },
    {
        "id": "Discourse Representation Theory",
        "year": "1981",
        "desc": "Hans Kamp invents Discourse Representation Theory, which creates representations for inter-sentential references",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Discourse_representation_theory"
        }
    },
    {
        "id": "Centering Theory",
        "year": "1983",
        "desc": "Barbara Grosz, Aravind K. Joshi and Scott Weinstein present a unified account of anaphora resolution that describes the preferences for pronouns and definite noune phrases. Their 1995 paper 'Centering: A Framework for Modeling the Local Coherence of Discourse' provides a more complete theory",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Anaphora_(linguistics)#Anaphora_resolution_%E2%80%93_centering_theory"
        }
    },
    {
        "id": "Case-based Reasoning",
        "year": "1983",
        "desc": "Janet Kolodner, a student of Roger Schank, develops CYRUS, the first CBR system. It creates new plans by modifying existing plans, rather than deriving them from first principles.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Case-based_reasoning"
        }
    },
    {
      "id": "BDI",
      "year": "1987",
      "desc": "The book \"Intention, Plans, and Practical Reason\", written by Michael Bratman, was published. It describes the BDI model (Belief-Desire-Intention) of action selection.",
      "links": {
        "Wikipedia": "https://en.wikipedia.org/wiki/Belief-desire-intention_software_model"
      },
      "dependencyOf": ["calo"]
    },
    {
        "id": "Linked Open Data",
        "year": "2006",
        "desc": "Tim Berners-Lee, inventor of the WWW and director of the W3C coined the term Linked (Open) Data to described structured data which is interlinked with other data over the internet. Large interconnected open databases have spawned many new question answering systems that mean to access this data. Many of these databases are triple stores that are accessible via the query language Sparql.",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/Linked_data"
        }
    },
    {
        "id": "The generative pre-trained transformer",
        "year": "2018",
        "desc": "The invention of the transformer neural network model by Google Brain, Google Research, and University of Toronto, lead Researchers of OpenAI to develop GPT, a language model that is able to generate syntactically correct sentences based on an unbound set of conversation subjects. It opens the door for a variety of language tasks without the need for hard-coded request-response rules (see chatbot).",
        "links": {
            "Wikipedia": "https://en.wikipedia.org/wiki/GPT-2"
        }
    }
]
